---
title: DuctFittingAndAccessoryData
classe: Autodesk.Revit.DB.Mechanical.DuctFittingAndAccessoryData
namespace: Autodesk.Revit.DB.Mechanical
eredita: System.Object
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 10
---

# DuctFittingAndAccessoryData

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `Double AirViscosity { get; }` | `ductFittingAndAccessoryData.AirViscosity` | Double |
| `Boolean IsValidObject { get; }` | `ductFittingAndAccessoryData.IsValidObject` | Boolean |
| `XYZ Origin { get; }` | `ductFittingAndAccessoryData.Origin` | XYZ |
| `PartType PartType { get; }` | `ductFittingAndAccessoryData.PartType` | PartType |
| `Guid ServerGUID { get; }` | `ductFittingAndAccessoryData.ServerGUID` | Guid |
| `MEPSystemClassification SystemClassification { get; }` | `ductFittingAndAccessoryData.SystemClassification` | MEPSystemClassification |
| `Void Dispose()` | `ductFittingAndAccessoryData.Dispose()` | Void |
| `IList<DuctFittingAndAccessoryConnectorData> GetAllConnectorData()` | `ductFittingAndAccessoryData.GetAllConnectorData()` | IList<DuctFittingAndAccessoryConnectorData> |
| `Entity GetEntity()` | `ductFittingAndAccessoryData.GetEntity()` | Entity |
| `ElementId GetFamilyInstanceId()` | `ductFittingAndAccessoryData.GetFamilyInstanceId()` | ElementId |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```